; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	infrared2 - mode
	thermograph1 - mode
	infrared0 - mode
	Star0 - direction
	GroundStation3 - direction
	Star5 - direction
	Star2 - direction
	Star6 - direction
	GroundStation8 - direction
	Star9 - direction
	Star1 - direction
	Star7 - direction
	GroundStation4 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Planet13 - direction
	Planet14 - direction
	Planet15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 infrared0)
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation4)
	(supports instrument3 infrared0)
	(supports instrument3 thermograph1)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 GroundStation8)
	(supports instrument4 infrared2)
	(supports instrument4 thermograph1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star7)
	(calibration_target instrument4 Star9)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 Star1)
	(calibration_target instrument5 Star2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
	(supports instrument6 infrared2)
	(supports instrument6 infrared0)
	(calibration_target instrument6 Star6)
	(calibration_target instrument6 Star7)
	(supports instrument7 infrared0)
	(supports instrument7 infrared2)
	(calibration_target instrument7 Star1)
	(calibration_target instrument7 Star9)
	(calibration_target instrument7 GroundStation8)
	(supports instrument8 infrared0)
	(supports instrument8 thermograph1)
	(calibration_target instrument8 GroundStation4)
	(calibration_target instrument8 Star7)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet15)
)
(:goal (and
	(pointing satellite1 Planet14)
	(have_image Phenomenon10 infrared2)
	(have_image Phenomenon11 thermograph1)
	(have_image Planet12 infrared2)
	(have_image Planet13 infrared2)
	(have_image Planet14 infrared0)
	(have_image Planet15 infrared0)
	(have_image Planet16 infrared0)
))

)

; plan
1. (turn_to satellite1 groundstation4 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 groundstation4)
   goals met: 0 of 8
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 8
3. (calibrate satellite1 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 0 of 8
4. (turn_to satellite1 planet13 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 planet13)
   goals met: 0 of 8
5. (take_image satellite1 planet13 instrument3 infrared2)
   added: (have_image planet13 infrared2)
   goals met: 1 of 8
6. (turn_to satellite1 planet12 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet12)
   goals met: 1 of 8
7. (take_image satellite1 planet12 instrument3 infrared2)
   added: (have_image planet12 infrared2)
   goals met: 2 of 8
8. (turn_to satellite1 phenomenon11 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 phenomenon11)
   goals met: 2 of 8
9. (take_image satellite1 phenomenon11 instrument3 thermograph1)
   added: (have_image phenomenon11 thermograph1)
   goals met: 3 of 8
10. (turn_to satellite1 phenomenon10 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon10)
   goals met: 3 of 8
11. (take_image satellite1 phenomenon10 instrument3 infrared2)
   added: (have_image phenomenon10 infrared2)
   goals met: 4 of 8
12. (turn_to satellite1 planet15 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet15)
   goals met: 4 of 8
13. (take_image satellite1 planet15 instrument3 infrared0)
   added: (have_image planet15 infrared0)
   goals met: 5 of 8
14. (turn_to satellite1 planet16 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 planet16)
   goals met: 5 of 8
15. (take_image satellite1 planet16 instrument3 infrared0)
   added: (have_image planet16 infrared0)
   goals met: 6 of 8
16. (turn_to satellite1 planet14 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 planet14)
   goals met: 7 of 8
17. (take_image satellite1 planet14 instrument3 infrared0)
   added: (have_image planet14 infrared0)
   goals met: 8 of 8
